export const CST = {
    SCENE: {
        LOADINGSCENE: "LoadingScene",
        LOBBYSCENE: "LobbyScene",
        GAMESCENE: "GameScene",
        GAMESCENE2: "GameScene2",
        GAMESCENE3: "GameScene3",
        GAMESCENE4: "GameScene4"
    }
}

export const socket = io();

export const LABEL_ID = {
    DOOR_FORWARD_ID: 11111111,
    DOOR_FORWARD2_ID: 11111112,
    DOOR_BACK_ID: 22222222,
    FIRST_KEY: 33333333,
    SECOND_KEY: 44444444,
    THIRD_KEY: 55555555,
    FOURTH_KEY: 6666666,
    FIVETH_KEY: 7777777,
    SIXETH_KEY: 8888888,
    CLUE_KEY: 99999999,
}

export const myMap = new Map([
    ['firstKey', { x: 350, text: 'Ею ргыол фхгуюм зриерлн киояиегуг, е нсхсусп\nстлфюегихфв тиуегв ъгфхя тулжсхсеоирли киояв.\nЕ зриерлни фнгкгрс, ъхс зов тулжсхсеоирлв киояв\nрисдшсзлпс лфтсояксегхя пцшспсую. Е тиуеюм\nзиря ср лфтсояксего 1 пцшспсу, ес ехсусм зиря ср\nлфтсояксего иьи 3 пцшспсуг.' }],
    ['secondKey', { x: 370, text: 'Е фхгусм нрлжи ею ргшсзлхи уищитх ыифхсм\nъгфхл тулжсхсеоирли киояв. Е нрлжи жсесулхфв,\nъхс е тиуеюм зиря рцйрс фсдугхя 5 олфхяие\nзиуиег Оцъим, г рг фоизцбьлм зиря иьи 3 олфхг.' }],
    ['thirdKey', { x: 350, text: 'Е цжоц огдсугхсулл сдргуцйир чогнср ф\nлрфхуцнщлим, нсхсугв стлфюегих хуихяб\nъгфхя тулжсхсеоирлв киояв. Е лрфхуцнщлл\nфнгкгрс, ъхс зов тиуесжс ахгтг рцйрс 4 фоикю,\nг зов ехсусжс ахгтг иьи 3 фоикю.' }],
    ['fourthKey', { x: 420, text: 'Е цжоц огдсугхсулл ею ргыол кгтлфнц, е\nнсхсусм стлфюегихфв ехсугв ъгфхя\nтулжсхсеоирли киояв. Е кгтлфни фнгкгрс,\nъхс рг тулжсхсеоирли киояв хуидцихфв 3\nнуюог оихцъим пюыл.' }],
    ['fiverthKey', { x: 350, text: 'Ею ргыол зуиерлм пгрцфнултх, е нсхсусп\nстлфюегихфв ъихеиухгв ъгфхя тулжсхсеоирли\nкиояв. Е пгрцфнултхи фнгкгрс, ъхс зов\nтулжсхсеоирлв киояв хуидцихфв лфтсояксегхя\nъиыцб зугнсрг. Сзрг ъиыцв цйи оийлх рг\nфхсои. Тс пгрцфнултхц, зов кгеиуыирлв уищитхг\nрцйрс иьи фхсоянс йи.' }],
    ['sixethKey', { x: 390, text: 'Рг сзрсм лк тсосн ею ргшсзлхи фхгулррюм\nфелхсн, е нсхсусп стлфюегихфв твхгв ъгфхя\nтулжсхсеоирли киояв. Е фелхни жсесулхфв, ъхс рг\nнгйзсп ахгти тулжсхсеоирлв рцйрс зсдгелхя\nтс 2 нсурв фгпсщеихг. Ефижс ахгтсе 3.' }],
]);